app/views/messages/index.html.haml

SELECT `users`.* FROM `users` INNER JOIN `members` ON `users`.`id` = `members`.`user_id` WHERE `members`.`group_id` = 12
---
      .main__header--member
        -# - @group.users.each do |user|

SELECT `messages`.* FROM `messages` WHERE `messages`.`group_id` = 12
---
    .main__body
      - @group.messages.each do |message|
        .main__body.clearfix
          .main__body--name