app/views/groups/new.html.haml

            #chat-group-user-192.chat-group-user.clearfix
              =f.collection_check_boxes(:user_ids,User.all, :id, :name)
---
SELECT `users`.* FROM `users`