app/controllers/groups_controller.rb

SELECT `users`.* FROM `users`
---
  def new
    @group = Group.new
    @users = User.all

INSERT INTO `groups` (`id`, `name`, `created_at`, `updated_at`) VALUES (20, 'abc', '2016-10-23 07:00:36', '2016-10-23 07:00:36')
---
  def create
    @group = Group.create(create_params)

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 9 LIMIT 1
---
  def edit
    @group = Group.find(params[:id])

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 9 LIMIT 1
UPDATE `groups` SET `name` = 'example11', `updated_at` = '2016-10-21 05:55:56' WHERE `groups`.`id` = 9
---
  def update
    @group = Group.find(params[:id])
    if @group.save