app/controllers/messages_controller.rb

  def index
    @groups = Group.all
    @message = Message.new
    @group = Group.find(params[:group_id])
---
SELECT `groups`.* FROM `groups`
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = NULL LIMIT 1

  def create
    @message = Message.create(create_params)
    respond_to do |format|
      if @message.save
        flash[:success] = "OK!"
        redirect_to group_messages_path(@message.group_id)and return

        msg = {name: @message.user.name, date: @message.created_at, body: @message.body,image: @message.image}
        render :json => msg
      else
        flash[:error] = "空欄のため送信できませんでした"
        redirect_to group_messages_path(@message.group_id)and return
---
INSERT INTO `messages` (`user_id`, `group_id`, `created_at`, `updated_at`, `body`) VALUES (4, 3, '2016-10-22 08:26:12', '2016-10-22 08:26:12', 'tutut')
UPDATE `messages` SET `user_id` = 3, `group_id` = 12, `updated_at` = '2016-10-23 04:02:00' WHERE `messages`.`id` = 56
SELECT `groups`.`id` FROM `groups` INNER JOIN `members` ON `groups`.`id` = `members`.`group_id` WHERE `members`.`user_id` = 4
SELECT `messages`.* FROM `messages` WHERE `messages`.`user_id` = 4