app/controllers/users_controller.rb

  def update
    user = User.find(params[:id])
    if user.update_with_password(update_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `name` = 'a', `updated_at` = '2016-10-20 06:39:19' WHERE `users`.`id` = 3